benchmark/FieldExamples/zeroThicknessMembraneHydrostatic/zeroThicknessMembraneOF/constant/EmpireDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

FSIInterfaces (
	baffle1 {
		patchNames (baffle1);
	}
	baffle2 {
		patchNames (baffle2);
	}
);
densityFluid   densityFluid [ 1 -3 0 0 0 0 0 ] 1000;

// ************************************************************************* //
